// Обновленные сообщения
window.SITE_DATA = {
    her_name: "Аля",
    your_name: "Коля",
    meet_date: "2024-06-18",
    love_quote: "Влечение - оголяющее, обезоруживающее и окрыляющее чувство.",

    // Обновленные комплименты
    messages: [
        "Ты — смертельная булавочка в стоге жизни!",
        "Твоя улыбка весьма убийственна!",
        "Я скучаю по тебе, а когда ты рядом, переживаю, что стану хайдом!",
        "Общение с тобой — лучший способ тренировки перикарда!",
        "Ты — самый ядовитый и прекрасный цветок в моём гербарии!",
        "Мне нравится, как твой взгляд насквозь пронзает банальность этого мира! ",
        "Ты — трещина в стене моего идеального одиночества!️",
        "Твой ум острее, чем любой клинок в зале фехтования!",
        "Ты — самая захватывающая катастрофа, которую я когда-либо наблюдал!",
    ],

    // Обновленные воспоминания
    memories: [
        {
            id: 1,
            title: "Начало чего-то большего",
            date: "2024-06-18",
            description: "Мы c тобой вместе прекрасно провели время, и решили проводить его также чудесно дальше.",
            image: "images/memories1.jpg"
        },
        {
            id: 2,
            title: "Проводим время вместе с чудными задумками",
            date: "2024-10-08",
            description: "Мне с тобой весело и ты классно шутишь, юмор отменный.",
            image: "images/memories2.jpg"
        },
        {
            id: 3,
            title: "Дурачимся",
            date: "2024-11-25",
            description: "Даже не помню как ты его измазала, но было весело",
            image: "images/memories3.jpg"
        },
        {
            id: 4,
            title: "Диснеевская принцесса",
            date: "2025-01-06",
            description: "Пожалуй, это был чудесный момент, сложилось впечатление, что ты попала туда, куда всегда и должна была попасть.",
            image: "images/memories4.jpg"
        },
        {
            id: 5,
            title: "Мастерица Алю",
            date: "2025-01-06",
            description: "Определенно твоя пчелка получилась идеальной.",
            image: "images/memories5.jpg"
        },
        {
            id: 6,
            title: "Красавица-зима",
            date: "2025-03-03",
            description: "Я наслаждался солнцем, теплом марта и твоей легкостью и красотой.",
            image: "images/memories6.jpg"
        },
        {
            id: 7,
            title: "Фотокабинка",
            date: "2025-03-23",
            description: "Мне очень понравился мой день рождения, мне так было хорошо от мысли что я провожу его впервые в жизни со своей девушкой.",
            image: "images/memories7.jpg"
        },
        {
            id: 8,
            title: "Фото в лифте",
            date: "2025-04-06",
            description: "Думаю, что это было максимально обыденное фото, но мы на нем выглядим как-то легче, нежнее и безмятежнее, чем обычно можем выглядеть.",
            image: "images/memories8.jpg"
        },
        {
            id: 9,
            title: "На практике",
            date: "2025-06-13",
            description: "Комментарии излишне, убери камеру, звезда зоологии здесь.",
            image: "images/memories9.jpg"
        },
        {
            id: 10,
            title: "На практике, но уже в городе",
            date: "2025-06-20",
            description: "Я просто дурачился, но получилось вроде неплохо.",
            image: "images/memories10.jpg"
        },
        {
            id: 11,
            title: "Поехали до Енисея",
            date: "2025-06-28",
            description: "Полюбовались водичкой, пофотались и покушали шаурму. Ты прекрасно выглядишь на фоне камней и водички.",
            image: "images/memories11.jpg"
        },
        {
            id: 12,
            title: "Только головешка)",
            date: "2025-08-12",
            description: "Я был там раньше, но с тобой это было по-другому.",
            image: "images/memories12.jpg"
        },
        {
            id: 13,
            title: "В подъеме",
            date: "2025-08-14",
            description: "Я и моя принцесса побывали в чудесном парке садов.",
            image: "images/memories13.jpg"
        },
        {
            id: 14,
            title: "На пекле",
            date: "2025-08-25",
            description: "Сложилось впечатление, что в тот момент в комнате температура была равна температуре на поверхности Солнца, а именно 6000 градусов.",
            image: "images/memories14.jpg"
        },
        {
            id: 15,
            title: "Алю в зазеркалье",
            date: "2026-01-02",
            description: "Вроде оптика, а вроде магия, сложно сказать...",
            image: "images/memories15.jpg"
        },
        {
            id: 16,
            title: "При свечах",
            date: "2026-01-07",
            description: "Тут уже точно магия, Expelliarmus!",
            image: "images/memories16.jpg"
        },
    ],

    // Обновленные обещания
    secret_promises: [
        {
            title: "Обещание парня",
            text: "Я буду любить тебя всегда."
        },
        {
            title: "Обещание повара",
            text: "Я буду готовить лучше"
        },
        {
            title: "Обещание клининг-менеджера",
            text: "Я буду мыть лучше."
        },
        {
            title: "Обещание швейцара",
            text: "Я буду открывать для тебя двери лучше."
        },
        {
            title: "Обещание романтика",
            text: "Каждый месяц у нас будут все богатства мира, даже если только во снах. Хотя самое дорогое, что есть, я уже обрел."
        }
    ],

    // Обновленное персональное сообщение
    personal_message: "Аля, с того дня как я осознал что мы вместе, в голове была мысль: могло ли быть что-то иначе... Мне кажется, что все случилось именно так, как и должно было случиться, спасибо тебе за все, Моя дорогая."
};